tec/macrut.tex
\section{Archivo io.mac}
\label{sec-1}
Macros para entrada y salida utilizando interrupciones. Son
ejecutables en DOS. Para emular DOS se utilizó DOSBox. Es ensamblado
por NASM.
  
\subsection{TERMINAR\_PROGRAMA}
\label{sec-1-1}
Salir del programa
\begin{itemize}
\item Entrada
\begin{description}
\item[vacio] nada
\end{description}
\item Salida
\begin{description}
\item[vacio] nada
\end{description}
\end{itemize}

\subsection{PRINT}
\label{sec-1-2}
Imprimir cadena en salida estandar.
\begin{itemize}
\item Entrada
\begin{description}
\item[dx,\%1] puntero a cadena que termina en ''\$''
\end{description}
\item Salida
\begin{description}
\item[vacio] nada
\end{description}
\end{itemize}

\subsection{PRINT\_CHAR}
\label{sec-1-3}
Imprimir caracter en la salida estandar
\begin{itemize}
\item Entrada
\begin{description}
\item[dl,\%1] el caracter a imprimir
\end{description}
\item Salida
\begin{description}
\item[al] la ultima salida de caracter
\end{description}
\end{itemize}
\href{http://www.ctyme.com/intr/rb-2554.htm}{ir}

\subsection{ABRIR\_ARCHIVO}
\label{sec-1-4}
Abre un archivo existente.
\begin{itemize}
\item Entrada
\begin{description}
\item[dx,\%1] puntero a cadena con nombre/ruta del archivo a
abrir. Este nombre debe finalizar en 0
\end{description}
\item Salidas
\begin{description}
\item[CF=0] archivo se abrio exitosamente. En AX el handle
del archivo
\item[CF=1] ocurrio algun error. El código del error en AX
\end{description}
\end{itemize}
\href{http://www.ctyme.com/intr/rb-2779.htm}{ir}

\subsection{LEER\_ARCHIVO}
\label{sec-1-5}
Lee archivo abierto.
\begin{itemize}
\item Entradas
\begin{description}
\item[bx,\%1] handle del archivo
\item[cx,\%2] numero de bytes a leer
\item[dx,\%3] buffer en donde guardar lo leido
\end{description}
\item Salidas
\begin{description}
\item[CF=0] se leyo exitosamente. En AX el numero de bytes
actualmente leídos
\item[CF=1] ocurrio algun error. El código del error en AX
\end{description}
\end{itemize}
\href{http://www.ctyme.com/intr/rb-2783.htm}{ir}


\subsection{ESENAR}
\label{sec-1-6}
EScribir EN un ARchivo abierto
\begin{itemize}
\item Entradas
\begin{description}
\item[bx,\%1] handle del archivo
\item[cx,\%2] numero de bytes a escribir
\item[dx,\%3] puntero a array que se escribirá
\end{description}
\item Salidas
\begin{description}
\item[CF=0] se escribió exitosamente. En AX el numero de
bytes actualmente escritos.
\item[CF=1] ocurrio algun error. El código del error en AX
(05h,06h).
\end{description}
\end{itemize}
\href{http://www.ctyme.com/intr/rb-2791.htm}{ir}


\subsection{CERRAR\_ARCHIVO}
\label{sec-1-7}
Cierra un archivo
\begin{itemize}
\item Entrada
\begin{description}
\item[bx,\%1] handle del archivo a cerrar
\end{description}
\item Salida
\begin{description}
\item[CF=0] se cerro exitosamente. AX destruido
\item[CF=1] ocurrio algun error al cerrar. En AX el código
de error (06h).
\end{description}
\end{itemize}

\subsection{CREAR\_ARCHIVO}
\label{sec-1-8}
Crear un archivo nuevo o truncar si ya existe.
\begin{itemize}
\item Entrada
\begin{description}
\item[dx,\%1] puntero a cadena que será nombre del
archivo. Este nombre debe terminar en 0.
\end{description}
\item Salida
\begin{description}
\item[CF=0] se creo exitosamente. En AX el handle de
archivo.
\item[CF=1] ocurrio algun error al crear En AX el código
de error (03h,04h,05h).
\end{description}
\end{itemize}
\href{http://www.ctyme.com/intr/rb-2778.htm#Table1401}{ir}


\subsection{UBICAR\_CURSOR}
\label{sec-1-9}
ubicar cursor en la pantalla cuando se esta en modo
texto.
\begin{itemize}
\item Entradas
\begin{description}
\item[dh,\%1] fila
\item[dl,\%2] columna
\end{description}
\end{itemize}


\subsection{LIMPIAR\_PANTALLA}
\label{sec-1-10}
Limpiar pantalla cuando se esta en modo texto.
\begin{itemize}
\item Entrada
\begin{description}
\item[vacio] nada
\end{description}
\item Salida
\begin{description}
\item[vacio] nada
\end{description}
\end{itemize}


\subsection{DESPLAZAR\_ARRIBA}
\label{sec-1-11}
Desplaza hacia arriba. Es como borrar la pantalla según los
parámentros explicados a  continuación:
\begin{itemize}
\item Entrada
\begin{description}
\item[ch,\%1] fila superior izquierda
\item[cl,\%2] columna superior izquierda
\item[dh,\%3] fila inferior derecha
\item[dl,\%4] columna inferior derecha
\item[al,\%5] número de líneas a desplazarse hacia arriba
\end{description}
\item Salida
\begin{description}
\item[vacio] nada
\end{description}
\end{itemize}

\href{http://www.ctyme.com/intr/rb-0096.htm}{ir}


\subsection{GETCHAR}
\label{sec-1-12}
Obtiene ascii de tecla presionada sin eco, via BIOS.
\begin{itemize}
\item Entrada
\begin{description}
\item[vacio] nada
\end{description}
\item Salida
\begin{description}
\item[AL] en este registro se almacena el caracter leido
\end{description}
\end{itemize}

\subsection{READ\_FOR\_BUFF\_INPUT}
\label{sec-1-13}
lee cadena de entrada estandar y lo guarda un arreglo. Se
refirá a este arreglo como buffInput, de aqui en adelante. 
\begin{itemize}
\item Entradas
\begin{description}
\item[dh,\%1] fila
\item[bx,\%2] columna
\item[dx,\%3] arreglo donde guardar la entrada del usuario
\end{description}
\item Salida
\begin{itemize}
\item arreglo buffInput con la entrada del usuario. La
interrupcion utilizada deja dicho arreglo en el
siguiente formato, suponiedo que el usuario ingreso
la cadena ''cad'' en la entrada estandar:
\begin{verbatim}
+--+---+---+---+---+----+---+
|41| 3 | c | a | d | \r |.. |
+--+---+---+---+---+----+---+
\end{verbatim}

donde:
\begin{itemize}
\item\relax [buffInput] contiene 41, indica el numero maximo de
chars que puede guardar
\item\relax [buffInput+1] contiene 3 indica el numero de chars
ingresados por el usuario
\item\relax [buffInput+2] contiene ''c'' es el primer char de la
cadena ingresada. La siguientes dos posiciones tiene
''a'' y ''d''
\item\relax [buffInput+5] contiene el retorno de carro. El
contenido del resto del arreglo esta indefinido
\end{itemize}
\end{itemize}
\end{itemize}

\subsection{READ\_FOR\_BUFF\_INPUT}
\label{sec-1-14}
Lee cadena de entrada estandar y lo guarda un arreglo. NO
necesita de fila y columna.
\begin{itemize}
\item Entradas
\begin{description}
\item[dx,\%1] arreglo donde guardar la entrada del usuario
\end{description}
\item Salida
\begin{itemize}
\item arreglo buffInput con la entrada del usuario.
\end{itemize}
\end{itemize}

\subsection{PRINT}
\label{sec-1-15}
Imprimir cadena en salida estandar en una fila y columna
especificada.
\begin{itemize}
\item Entrada
\begin{description}
\item[dh,\%1] fila
\item[dl,\%2] columna
\item[dx,\%3] puntero a cadena que termina en ''\$''
\end{description}
\item Salida
\begin{description}
\item[vacio] nada
\end{description}
\end{itemize}

\subsection{GETCHAR}
\label{sec-1-16}
Obtiene ascii de tecla presionada, aunque se emplea para
parar el programa, hasta que el usuario presione alguna
tecla, mostrando un mensaje que venga al caso.
\begin{itemize}
\item Entrada
\begin{description}
\item[\%1] Puntero a cadena que se mostrara.
\end{description}
\item Salida
\begin{description}
\item[AL] en este registro se almacena el caracter leido
\end{description}
\end{itemize}

\section{Archivo anlex2.asm}
\label{sec-2}
Contiene la funcion ''scanner'' que realiza el analisis lexico de una
funcion polinomica de grado 4 con coeficientes de dos digitos
positivos o negativos. Un termino correcto debe iniciar con ''+'' o ''-''
seguido de cero, uno o dos digitos. Luego puede venir o no una ''x'' o
bien ''x'' seguido por ''2'' o ''3'' o ''4''. La expresion regular es la
siguiente:
\begin{verbatim}
ER=(('+'|'-')(<d>?<d>)?[x^<expo>|x]?)+;
donde: <d>=0|1|2|3|4|5|6|7|8|9 y <expo>=2|3|4
\end{verbatim}

Estos son algunos ejemplos de cadenas lexicamente correctas para este
lenguaje (debe terminar en '';''):
\begin{verbatim}
+2x+1-99x  +29  +x +29;
-90x^3 +5  5x^2;
\end{verbatim}


\subsection{scanner}
\label{sec-2-1}

Realiza un analisis lexico de la cadena terminada en '';''. Muestra fila
y columna si ocurre error. Muestra exito si se reconoce la
cadena. Guarda los exponentes y coeficientes en una arreglo de
estructuras.

\begin{itemize}
\item Parametro
\begin{description}
\item[[BP+6]] puntero al primer elemento del arreglo de chars a
analizar
\item[[BP+4]] puntero a estructura que guarda coeficientes y
exponentes y otros datos de la funcion.
\end{description}
\item Variables Locales
\begin{enumerate}
\item\relax [BP-2]  fila
\item\relax [BP-4]  columna
\item\relax [BP-6]  entrada
\item\relax [BP-8]  estado
\item\relax [BP-0xA]  exponente
\item\relax [BP-0xC]  primer char ascii de un coeficiente
\item\relax [BP-0xE]  segundo char ascii de un coeficiente
\item\relax [BP-0x10]  tercer char ascii de un coeficiente
\item\relax [BP-0x12]  numero de chars que forman el coeficiente
\item\relax [BP-0x14] contador de terminos por funcion
\end{enumerate}
\end{itemize}
