tec/macrut.org
** scanner_f
Lo mismo que scanner solo que trabaja con un archivo.

+ Parametro
  - [BP+6] :: handle del archivo de donde lee
  - [BP+4] :: puntero a estructura que guarda coeficientes y
              exponentes y otros datos de la funcion.
+ Variables Locales
  1. [BP-2]  fila
  2. [BP-4]  columna
  3. [BP-6]  entrada
  4. [BP-8]  estado
  5. [BP-0xA]  exponente
  6. [BP-0xC]  primer char ascii de un coeficiente
  7. [BP-0xE]  segundo char ascii de un coeficiente
  8. [BP-0x10]  tercer char ascii de un coeficiente
  9. [BP-0x12]  numero de chars que forman el coeficiente
  10. [BP-0x14] contador de terminos por función

** rutinaDeError
Imprime un mensaje de error lexico.
+ Parametros
  - [bp+8] :: Fila en binario
  - [bp+6] :: Columna en binario
  - [bp+4] :: El caracter ascii que causo el error
+ Entrada
  - bx :: puntero a cadena que describe el error
+ Salidas
  - vacio :: nada	

** convNumStrParaNumBin
Convertir numero en string a numero en binario para el manejo interno
como cantidad de la representacion numerica de la cadena. Se utilizó
para leer la cadena directamente de la pila.

+ Entradas
  - di :: puntero al primer elemento del arreglo de caracteres
          (cadena) a convertir. Cada caracter debe estar a cada dos
          bytes. Esto es porque se utilizó para leer de la pila cuyos
          elementos son de 2 bytes.

  - cl :: tamaño de la cadena apuntada por bx

+ Salida
  - ax :: el numero de 1 word en binario. En complemento a dos si es
          negativo.

+ Variable local
  - [BP-2] :: variable temporal (temp) que guarda la cantidad que
              finalmente se guarda en ax al terminar el proceso

** convNumStrParaNumBin_arr
Igual que 'convNumStrParaNumBin' solo que el array de caracteres deben
estar a cada byte no a cada dos, esto para que no necesariamente deba
leerse desde la pila.
+ Entradas
  - di :: puntero al primer elemento del arreglo de caracteres
          (cadena) a convertir.
  - cl :: tamaño de la cadena apuntada por di

+ Salida
  - ax :: el numero de 1 word en binario. En complemento a dos si es
          negativo.

+ Variable local
  - [BP-2] :: variable temporal (temp) que guarda la cantidad que
              finalmente se guarda en ax al terminar el proceso

** printNumBin
Imprimir numero binario en la salida estandar
+ Entradas
  - ax :: el numero binario (word) a imprimir
+ Salidas
  - vacio :: nada


** printNumBin_mas
Lo mismo que printNumBin solo que los positivos les antepone el signo
positivo '+'
+ Entradas
  - ax :: el numero binario (word) a imprimir
+ Salidas
  - vacio :: nada


* Archivo ploter.asm

** dibujar_plano
dibuja los ejes X y Y del plano cartesiano
+ Parámetros
  - [BP+6] :: posición x del origen
  - [BP+4] :: posición y del origen

** putPixel
Pinta un pixel en cordenada y color dado. Las coordenadas
son con respecto al origen del plano establecido durante la
llamada ha 'dibujar_plano'.
+ Entradas
  - dl :: color
  - bx :: coordenada x
  - ax :: coordenada y

** dibujar_linea_horizontal
dibuja una linea horizontal
+ Parámetros
  - [BP+10] :: color
  - [BP+8] :: ancho
  - [BP+6] :: x
  - [BP+4] :: y


** dibujar_linea_vertical
Dibuja una linea vertical
+ Parámetros
  - [BP+10] :: color
  - [BP+8] :: alto
  - [BP+6] :: x
  - [BP+4] :: y

** dibujar_rectangulo
Dibuja un rectangulo relleno de un color dado.
+ Parámetros
  - [BP+12] :: color
  - [BP+10] :: ancho
  - [BP+8] :: alto
  - [BP+6] :: x
  - [BP+4] :: y

* Archivo rep.asm
** printPol_f
Imprimir polinomio en archivo
+ Parametros
  - [BP+6] :: handle del archivo
  - [BP+4] :: puntero al inicio del arreglo que contiene la
              expresion polinomica

** printCoef_f
Imprimir coeficiente en archivo
+ Parametros
  - [PB+8] :: handle del archivo
  - [BP+6] :: coeficiente en binario (word)
  - [BP+4] :: exponente en binario (byte)

** printNumBin_f
Imprimir numero binario en archivo
+ Parametro
  - [BP+6] :: valor para saber si se quiere imprimir los
              positivos anteponiendo un '+'. Si tiene el
              valor de POS_CON_MAS se imprime el '+'
  - [BP+4] :: handle del archivo
+ Entradas
  - ax :: el numero binario (word) a imprimir
+ Variables locales
  - [BP-2] :: un temporal para ax
  - [BP-4] :: un temporal para bx
  - [BP-6] :: un temporal para cx

* Archivo calgra.asm

** evalPol
Evaluar polinomio de 5 terminos como maximo
+ Entradas:
  - di :: puntero a estructura que contiene el
          polinomio a evaluar
+ Parámetros
  - [PB+4] :: número a evaluar de un word (x)
+ Variables locales
  - [BP-2] :: temporal que al final será ax
  - [BP-4] :: contador para bucle mayor
+ Salidas
  - ax :: el resultado de la evaluación (y)


** printInfoEsquina
imprimir cantidad de polinomios actuales en el sistema y
cuanto es el maximo que puede ingresarse. Esto en la
esquina inferior derecha.


Crear reportes.
+ Variables locales
  - [BP-2] :: handle de archivo ya sea el creado para
              polinomios del sistema o bien el creado para
              ecuaciones resueltas. Es uno o el otro nunca
              ámbos.
  - [BP-4] :: contador del bucle
  - [BP-6] :: para llevar la letra de cada funcion
  - [BP-8] :: temporal para la evaluacion de puntos
  - [BP-10] :: igual que el anterior

** setOrientacionPol
Establecer si un polinomio de grado 1,2,3 o 4, es positivo
o negativo. Para uso exclusivo de rutina =conocerGrado=.
+ Entradas
  - bx :: coeficiente del termino de exponenete mayor
+ Salidas
  - ah :: POL_POSITIVO si positivo y POL_POSITIVO-1 si
          negativo 


** conocerGrado
Saber el grado de un polinomio
+ Entradas
  - di :: puntero a estructura que contiene el polinomio
+ Salidas
  - al :: grado del polinomio
  - ah :: POL_POSITIVO si positivo y POL_POSITIVO-1 si
          negativo 	


** Graficar polinomios
+ Variables locales
  - [bp-2] :: contador temporal para bucle mayor
  - [bp-4] :: limite inferior del rango a graficar (x0)
  - [bp-6] :: limite superior del rango a graficar (x1)
  - [bp-8] :: factor por el cual se dividen los puntos en
              el eje Y, dependiendo si se trata de un
              polinomio de 1,2,3 o 4 grado, esto para que
              se logre la visualización más adecuada de la
              gráfica considerando que se tiene solo 200
              pixeles del modo de video para el eje Y. 


** printIntegral
Imprime una integral en salida estandar. Basicamente es lo
mismo que printPol, la diferencia es que antes de hacer la
llamada a printPol imprime la notacion de integrales.
+ Entrada
  - si :: polinomio integrado


