tec/macrut.tex


\subsection{scanner\_f}
\label{sec-2-2}
Lo mismo que scanner solo que trabaja con un archivo.

\begin{itemize}
\item Parametro
\begin{description}
\item[[BP+6]] handle del archivo de donde lee
\item[[BP+4]] puntero a estructura que guarda coeficientes y
exponentes y otros datos de la funcion.
\end{description}
\item Variables Locales
\begin{enumerate}
\item\relax [BP-2]  fila
\item\relax [BP-4]  columna
\item\relax [BP-6]  entrada
\item\relax [BP-8]  estado
\item\relax [BP-0xA]  exponente
\item\relax [BP-0xC]  primer char ascii de un coeficiente
\item\relax [BP-0xE]  segundo char ascii de un coeficiente
\item\relax [BP-0x10]  tercer char ascii de un coeficiente
\item\relax [BP-0x12]  numero de chars que forman el coeficiente
\item\relax [BP-0x14] contador de terminos por función
\end{enumerate}
\end{itemize}

\subsection{rutinaDeError}
\label{sec-2-3}
Imprime un mensaje de error lexico.
\begin{itemize}
\item Parametros
\begin{description}
\item[[bp+8]] Fila en binario
\item[[bp+6]] Columna en binario
\item[[bp+4]] El caracter ascii que causo el error
\end{description}
\item Entrada
\begin{description}
\item[bx] puntero a cadena que describe el error
\end{description}
\item Salidas
\begin{description}
\item[vacio] nada
\end{description}
\end{itemize}

\subsection{convNumStrParaNumBin}
\label{sec-2-4}
Convertir numero en string a numero en binario para el manejo interno
como cantidad de la representacion numerica de la cadena. Se utilizó
para leer la cadena directamente de la pila.

\begin{itemize}
\item Entradas
\begin{description}
\item[di] puntero al primer elemento del arreglo de caracteres
(cadena) a convertir. Cada caracter debe estar a cada dos
bytes. Esto es porque se utilizó para leer de la pila cuyos
elementos son de 2 bytes.

\item[cl] tamaño de la cadena apuntada por bx
\end{description}

\item Salida
\begin{description}
\item[ax] el numero de 1 word en binario. En complemento a dos si es
negativo.
\end{description}

\item Variable local
\begin{description}
\item[[BP-2]] variable temporal (temp) que guarda la cantidad que
finalmente se guarda en ax al terminar el proceso
\end{description}
\end{itemize}

\subsection{convNumStrParaNumBin\_arr}
\label{sec-2-5}
Igual que ''convNumStrParaNumBin'' solo que el array de caracteres deben
estar a cada byte no a cada dos, esto para que no necesariamente deba
leerse desde la pila.
\begin{itemize}
\item Entradas
\begin{description}
\item[di] puntero al primer elemento del arreglo de caracteres
(cadena) a convertir.
\item[cl] tamaño de la cadena apuntada por di
\end{description}

\item Salida
\begin{description}
\item[ax] el numero de 1 word en binario. En complemento a dos si es
negativo.
\end{description}

\item Variable local
\begin{description}
\item[[BP-2]] variable temporal (temp) que guarda la cantidad que
finalmente se guarda en ax al terminar el proceso
\end{description}
\end{itemize}

\subsection{printNumBin}
\label{sec-2-6}
Imprimir numero binario en la salida estandar
\begin{itemize}
\item Entradas
\begin{description}
\item[ax] el numero binario (word) a imprimir
\end{description}
\item Salidas
\begin{description}
\item[vacio] nada
\end{description}
\end{itemize}


\subsection{printNumBin\_mas}
\label{sec-2-7}
Lo mismo que printNumBin solo que los positivos les antepone el signo
positivo ''+''
\begin{itemize}
\item Entradas
\begin{description}
\item[ax] el numero binario (word) a imprimir
\end{description}
\item Salidas
\begin{description}
\item[vacio] nada
\end{description}
\end{itemize}


\section{Archivo ploter.asm}
\label{sec-3}

\subsection{dibujar\_plano}
\label{sec-3-1}
dibuja los ejes X y Y del plano cartesiano
\begin{itemize}
\item Parámetros
\begin{description}
\item[[BP+6]] posición x del origen
\item[[BP+4]] posición y del origen
\end{description}
\end{itemize}

\subsection{putPixel}
\label{sec-3-2}
Pinta un pixel en cordenada y color dado. Las coordenadas
son con respecto al origen del plano establecido durante la
llamada ha ''dibujar\_plano''.
\begin{itemize}
\item Entradas
\begin{description}
\item[dl] color
\item[bx] coordenada x
\item[ax] coordenada y
\end{description}
\end{itemize}

\subsection{dibujar\_linea\_horizontal}
\label{sec-3-3}
dibuja una linea horizontal
\begin{itemize}
\item Parámetros
\begin{description}
\item[[BP+10]] color
\item[[BP+8]] ancho
\item[[BP+6]] x
\item[[BP+4]] y
\end{description}
\end{itemize}


\subsection{dibujar\_linea\_vertical}
\label{sec-3-4}
Dibuja una linea vertical
\begin{itemize}
\item Parámetros
\begin{description}
\item[[BP+10]] color
\item[[BP+8]] alto
\item[[BP+6]] x
\item[[BP+4]] y
\end{description}
\end{itemize}

\subsection{dibujar\_rectangulo}
\label{sec-3-5}
Dibuja un rectangulo relleno de un color dado.
\begin{itemize}
\item Parámetros
\begin{description}
\item[[BP+12]] color
\item[[BP+10]] ancho
\item[[BP+8]] alto
\item[[BP+6]] x
\item[[BP+4]] y
\end{description}
\end{itemize}

\section{Archivo rep.asm}
\label{sec-4}
\subsection{printPol\_f}
\label{sec-4-1}
Imprimir polinomio en archivo
\begin{itemize}
\item Parametros
\begin{description}
\item[[BP+6]] handle del archivo
\item[[BP+4]] puntero al inicio del arreglo que contiene la
expresion polinomica
\end{description}
\end{itemize}

\subsection{printCoef\_f}
\label{sec-4-2}
Imprimir coeficiente en archivo
\begin{itemize}
\item Parametros
\begin{description}
\item[[PB+8]] handle del archivo
\item[[BP+6]] coeficiente en binario (word)
\item[[BP+4]] exponente en binario (byte)
\end{description}
\end{itemize}

\subsection{printNumBin\_f}
\label{sec-4-3}
Imprimir numero binario en archivo
\begin{itemize}
\item Parametro
\begin{description}
\item[[BP+6]] valor para saber si se quiere imprimir los
positivos anteponiendo un ''+''. Si tiene el
valor de POS\_CON\_MAS se imprime el ''+''
\item[[BP+4]] handle del archivo
\end{description}
\item Entradas
\begin{description}
\item[ax] el numero binario (word) a imprimir
\end{description}
\item Variables locales
\begin{description}
\item[[BP-2]] un temporal para ax
\item[[BP-4]] un temporal para bx
\item[[BP-6]] un temporal para cx
\end{description}
\end{itemize}

\section{Archivo calgra.asm}
\label{sec-5}

\subsection{evalPol}
\label{sec-5-1}
Evaluar polinomio de 5 terminos como maximo
\begin{itemize}
\item Entradas:
\begin{description}
\item[di] puntero a estructura que contiene el
polinomio a evaluar
\end{description}
\item Parámetros
\begin{description}
\item[[PB+4]] número a evaluar de un word (x)
\end{description}
\item Variables locales
\begin{description}
\item[[BP-2]] temporal que al final será ax
\item[[BP-4]] contador para bucle mayor
\end{description}
\item Salidas
\begin{description}
\item[ax] el resultado de la evaluación (y)
\end{description}
\end{itemize}


\subsection{printInfoEsquina}
\label{sec-5-2}
imprimir cantidad de polinomios actuales en el sistema y
cuanto es el maximo que puede ingresarse. Esto en la
esquina inferior derecha.


Crear reportes.
\begin{itemize}
\item Variables locales
\begin{description}
\item[[BP-2]] handle de archivo ya sea el creado para
polinomios del sistema o bien el creado para
ecuaciones resueltas. Es uno o el otro nunca
ámbos.
\item[[BP-4]] contador del bucle
\item[[BP-6]] para llevar la letra de cada funcion
\item[[BP-8]] temporal para la evaluacion de puntos
\item[[BP-10]] igual que el anterior
\end{description}
\end{itemize}

\subsection{setOrientacionPol}
\label{sec-5-3}
Establecer si un polinomio de grado 1,2,3 o 4, es positivo
o negativo. Para uso exclusivo de rutina \texttt{conocerGrado}.
\begin{itemize}
\item Entradas
\begin{description}
\item[bx] coeficiente del termino de exponenete mayor
\end{description}
\item Salidas
\begin{description}
\item[ah] POL\_POSITIVO si positivo y POL\_POSITIVO-1 si
negativo
\end{description}
\end{itemize}


\subsection{conocerGrado}
\label{sec-5-4}
Saber el grado de un polinomio
\begin{itemize}
\item Entradas
\begin{description}
\item[di] puntero a estructura que contiene el polinomio
\end{description}
\item Salidas
\begin{description}
\item[al] grado del polinomio
\item[ah] POL\_POSITIVO si positivo y POL\_POSITIVO-1 si
negativo
\end{description}
\end{itemize}


\subsection{Graficar polinomios}
\label{sec-5-5}
\begin{itemize}
\item Variables locales
\begin{description}
\item[[bp-2]] contador temporal para bucle mayor
\item[[bp-4]] limite inferior del rango a graficar (x0)
\item[[bp-6]] limite superior del rango a graficar (x1)
\item[[bp-8]] factor por el cual se dividen los puntos en
el eje Y, dependiendo si se trata de un
polinomio de 1,2,3 o 4 grado, esto para que
se logre la visualización más adecuada de la
gráfica considerando que se tiene solo 200
pixeles del modo de video para el eje Y.
\end{description}
\end{itemize}


\subsection{printIntegral}
\label{sec-5-6}
Imprime una integral en salida estandar. Basicamente es lo
mismo que printPol, la diferencia es que antes de hacer la
llamada a printPol imprime la notacion de integrales.
\begin{itemize}
\item Entrada
\begin{description}
\item[si] polinomio integrado
\end{description}
\end{itemize}
