tec/macrut.org
** printDerivada
Imprime una derivada en salida estandar. Basicamente es lo
mismo que printPol, la diferencia es que antes de hacer la
llamada a printPol imprime la notacion de derivadas.
+ Entrada
  - si :: polinomio derivado de otro polinomio


** printPolinomio
Imprime una integral en salida estandar. Basicamente es lo
mismo que printPol, la diferencia es que antes de hacer la
llamada a printPol imprime la notacion de funcion
identificandola con una letra mayuscula.
+ Entrada
  - di :: polinomio original que no es derivada ni integral
          de otro polinomio


** printCoef
Imprimir coeficiente en la salida estandar
+ Parametros
  - [BP+6] :: coeficiente en binario (word)
  - [BP+4] :: exponente en binario (byte)

** printPol
Imprimir polinomio en salida estandar
+ Parametros
  - [BP+4] :: puntero al inicio del arreglo que contiene la
              expresion polinomica

** integrarPol
Integra una polinomio de 5 terminos como maximo
+ Entrada:
  - di :: puntero a estructura que contiene el polinomio a
          integrar.
  - si :: puntero a estructura donde guardar la integración.

** integrarPol
Integra una polinomio de 5 terminos como maximo
+ Entrada:
  - di :: puntero a estructura que contiene el polinomio a
          derivar.
  - si :: puntero a estructura donde guardar la derivación.


** ing''
Opcion "ingresar" del menú principal, cuyo objetivo es
cargar un archivo con expresiones polinómicas terminadas en
';'
+ Variables Locales
  - [BP-2] :: guarda el handle del archivo abierto.
