tec/macrut.tex


\subsection{printDerivada}
\label{sec-5-7}
Imprime una derivada en salida estandar. Basicamente es lo
mismo que printPol, la diferencia es que antes de hacer la
llamada a printPol imprime la notacion de derivadas.
\begin{itemize}
\item Entrada
\begin{description}
\item[si] polinomio derivado de otro polinomio
\end{description}
\end{itemize}


\subsection{printPolinomio}
\label{sec-5-8}
Imprime una integral en salida estandar. Basicamente es lo
mismo que printPol, la diferencia es que antes de hacer la
llamada a printPol imprime la notacion de funcion
identificandola con una letra mayuscula.
\begin{itemize}
\item Entrada
\begin{description}
\item[di] polinomio original que no es derivada ni integral
de otro polinomio
\end{description}
\end{itemize}


\subsection{printCoef}
\label{sec-5-9}
Imprimir coeficiente en la salida estandar
\begin{itemize}
\item Parametros
\begin{description}
\item[[BP+6]] coeficiente en binario (word)
\item[[BP+4]] exponente en binario (byte)
\end{description}
\end{itemize}

\subsection{printPol}
\label{sec-5-10}
Imprimir polinomio en salida estandar
\begin{itemize}
\item Parametros
\begin{description}
\item[[BP+4]] puntero al inicio del arreglo que contiene la
expresion polinomica
\end{description}
\end{itemize}

\subsection{integrarPol}
\label{sec-5-11}
Integra una polinomio de 5 terminos como maximo
\begin{itemize}
\item Entrada:
\begin{description}
\item[di] puntero a estructura que contiene el polinomio a
integrar.
\item[si] puntero a estructura donde guardar la integración.
\end{description}
\end{itemize}

\subsection{integrarPol}
\label{sec-5-12}
Integra una polinomio de 5 terminos como maximo
\begin{itemize}
\item Entrada:
\begin{description}
\item[di] puntero a estructura que contiene el polinomio a
derivar.
\item[si] puntero a estructura donde guardar la derivación.
\end{description}
\end{itemize}


\subsection{ing}
\label{sec-5-13}
Opcion ''ingresar'' del menú principal, cuyo objetivo es
cargar un archivo con expresiones polinómicas terminadas en
'';''
\begin{itemize}
\item Variables Locales
\begin{description}
\item[[BP-2]] guarda el handle del archivo abierto.
\end{description}
\end{itemize}


%%% Local Variables:
%%% mode: latex
%%% TeX-master: "tec"
%%% End:
